type-tests/delete-type/jmeter-test-scenarios/500x200.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5-SNAPSHOT 8ecf734">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Object Store Delete Type 500/200" enabled="true">
      <boolProp name="TestPlan.functional_mode">true</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">200</stringProp>
        </LoopController>
        <hashTree>
          <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Type Name Counter" enabled="true">
            <stringProp name="CounterConfig.start">1</stringProp>
            <stringProp name="CounterConfig.end">100001</stringProp>
            <stringProp name="CounterConfig.incr">1</stringProp>
            <stringProp name="CounterConfig.name">type_counter</stringProp>
            <boolProp name="CounterConfig.per_user">false</boolProp>
          </CounterConfig>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
   &quot;id&quot;:null,&#xd;
   &quot;name&quot;: ${type_counter},&#xd;
   &quot;additionalProperties&quot;:true,&#xd;
   &quot;backendKeyDefinitions&quot;:[&#xd;
      {&#xd;
         &quot;key&quot;:&quot;primary&quot;,&#xd;
         &quot;type&quot;:&quot;primaryKey&quot;,&#xd;
         &quot;isNullAble&quot;:false,&#xd;
         &quot;isUnique&quot;:false&#xd;
      },&#xd;
      {&#xd;
         &quot;key&quot;:&quot;nestedObject&quot;,&#xd;
         &quot;type&quot;:&quot;object&quot;,&#xd;
         &quot;properties&quot;:[&#xd;
            {&#xd;
               &quot;key&quot;:&quot;1property&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;2property&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;3property&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;4property&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;5property&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;nestedObject2&quot;,&#xd;
               &quot;type&quot;:&quot;object&quot;,&#xd;
               &quot;properties&quot;:[&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;1property2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  },&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;2property2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  },&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;3property2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  },&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;4property2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  },&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;5property2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  }&#xd;
               ],&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:false,&#xd;
               &quot;additionalProperties&quot;:false&#xd;
            }&#xd;
         ],&#xd;
         &quot;isNullAble&quot;:false,&#xd;
         &quot;isUnique&quot;:false,&#xd;
         &quot;additionalProperties&quot;:false&#xd;
      },&#xd;
      {&#xd;
         &quot;key&quot;:&quot;primitiveArray&quot;,&#xd;
         &quot;type&quot;:&quot;array&quot;,&#xd;
         &quot;primitiveArrayType&quot;:&quot;string&quot;,&#xd;
         &quot;properties&quot;:[&#xd;
            &#xd;
         ],&#xd;
         &quot;isNullAble&quot;:false,&#xd;
         &quot;isUnique&quot;:false,&#xd;
         &quot;additionalProperties&quot;:false,&#xd;
         &quot;additionalItems&quot;:false&#xd;
      },&#xd;
      {&#xd;
         &quot;key&quot;:&quot;objectArray&quot;,&#xd;
         &quot;type&quot;:&quot;array&quot;,&#xd;
         &quot;primitiveArrayType&quot;:null,&#xd;
         &quot;properties&quot;:[&#xd;
            {&#xd;
               &quot;key&quot;:&quot;1propertyobjectArray&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;2propertyobjectArray&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;3propertyobjectArray&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;4propertyobjectArray&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;5propertyobjectArray&quot;,&#xd;
               &quot;type&quot;:&quot;string&quot;,&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:true&#xd;
            },&#xd;
            {&#xd;
               &quot;key&quot;:&quot;arraynestedObject2&quot;,&#xd;
               &quot;type&quot;:&quot;object&quot;,&#xd;
               &quot;properties&quot;:[&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;1propertyobjectArray2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  },&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;2propertyobjectArray2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  },&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;3propertyobjectArray2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  },&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;4propertyobjectArray2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  },&#xd;
                  {&#xd;
                     &quot;key&quot;:&quot;5propertyobjectArray2&quot;,&#xd;
                     &quot;type&quot;:&quot;string&quot;,&#xd;
                     &quot;isNullAble&quot;:false,&#xd;
                     &quot;isUnique&quot;:true&#xd;
                  }&#xd;
               ],&#xd;
               &quot;isNullAble&quot;:false,&#xd;
               &quot;isUnique&quot;:false,&#xd;
               &quot;additionalProperties&quot;:false&#xd;
            }&#xd;
         ],&#xd;
         &quot;isNullAble&quot;:false,&#xd;
         &quot;isUnique&quot;:false,&#xd;
         &quot;additionalProperties&quot;:false,&#xd;
         &quot;additionalItems&quot;:false&#xd;
      }&#xd;
   ]&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">8080</stringProp>
            <stringProp name="HTTPSampler.path">types</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">accept</stringProp>
                  <stringProp name="Header.value">*/*</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Connection</stringProp>
                  <stringProp name="Header.value">keep-alive</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">type_id${type_counter}</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.id</stringProp>
              <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
            </JSONPostProcessor>
            <hashTree/>
            <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="BeanShell Assertion" enabled="true">
              <stringProp name="BeanShellAssertion.query">props.put(&quot;type_id&quot; + vars.get(&quot;type_counter&quot;), vars.get(&quot;type_id&quot; + vars.get(&quot;type_counter&quot;)));</stringProp>
              <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
            </BeanShellAssertion>
            <hashTree/>
          </hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">prev.setIgnore()</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group Create Type" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">200</stringProp>
        </LoopController>
        <hashTree>
          <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Type Name Counter" enabled="true">
            <stringProp name="CounterConfig.start">1</stringProp>
            <stringProp name="CounterConfig.end">100001</stringProp>
            <stringProp name="CounterConfig.incr">1</stringProp>
            <stringProp name="CounterConfig.name">type_name_counter</stringProp>
            <boolProp name="CounterConfig.per_user">false</boolProp>
          </CounterConfig>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">8080</stringProp>
            <stringProp name="HTTPSampler.path">types/${__P(type_id${__V(${type_name_counter})})}</stringProp>
            <stringProp name="HTTPSampler.method">DELETE</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">accept</stringProp>
                  <stringProp name="Header.value">*/*</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Connection</stringProp>
                  <stringProp name="Header.value">keep-alive</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Responses 500 Users with 200 Requests" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="RespTimeGraph.interval">100</stringProp>
          <stringProp name="RespTimeGraph.graphtitle">Responses 5 Users with 200 Requests</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>